Manchester_Coding/Src/main_c.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-23 Do 16:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Foo X. Bar" />
</head>
<body>
<div id="content">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #cc0000;">/**</span>
<span style="color: #cc0000;">  ******************************************************************************</span>
<span style="color: #cc0000;">  * File Name          : main.c</span>
<span style="color: #cc0000;">  * Description        : Main program body</span>
<span style="color: #cc0000;">  ******************************************************************************</span>
<span style="color: #cc0000;">  ** This notice applies to any and all portions of this file</span>
<span style="color: #cc0000;">  * that are not between comment pairs USER CODE BEGIN and</span>
<span style="color: #cc0000;">  * USER CODE END. Other portions of this file, whether </span>
<span style="color: #cc0000;">  * inserted by the user or by software development tools</span>
<span style="color: #cc0000;">  * are owned by their respective copyright owners.</span>
<span style="color: #cc0000;">  *</span>
<span style="color: #cc0000;">  * COPYRIGHT(c) 2017 STMicroelectronics</span>
<span style="color: #cc0000;">  *</span>
<span style="color: #cc0000;">  * Redistribution and use in source and binary forms, with or without modification,</span>
<span style="color: #cc0000;">  * are permitted provided that the following conditions are met:</span>
<span style="color: #cc0000;">  *   1. Redistributions of source code must retain the above copyright notice,</span>
<span style="color: #cc0000;">  *      this list of conditions and the following disclaimer.</span>
<span style="color: #cc0000;">  *   2. Redistributions in binary form must reproduce the above copyright notice,</span>
<span style="color: #cc0000;">  *      this list of conditions and the following disclaimer in the documentation</span>
<span style="color: #cc0000;">  *      and/or other materials provided with the distribution.</span>
<span style="color: #cc0000;">  *   3. Neither the name of STMicroelectronics nor the names of its contributors</span>
<span style="color: #cc0000;">  *      may be used to endorse or promote products derived from this software</span>
<span style="color: #cc0000;">  *      without specific prior written permission.</span>
<span style="color: #cc0000;">  *</span>
<span style="color: #cc0000;">  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"</span>
<span style="color: #cc0000;">  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE</span>
<span style="color: #cc0000;">  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE</span>
<span style="color: #cc0000;">  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE</span>
<span style="color: #cc0000;">  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL</span>
<span style="color: #cc0000;">  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR</span>
<span style="color: #cc0000;">  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER</span>
<span style="color: #cc0000;">  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,</span>
<span style="color: #cc0000;">  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE</span>
<span style="color: #cc0000;">  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.</span>
<span style="color: #cc0000;">  *</span>
<span style="color: #cc0000;">  ******************************************************************************</span>
<span style="color: #cc0000;">  */</span>

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Includes ------------------------------------------------------------------</span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #b218b2;">#include</span> <span style="color: #ff1f8b;">"main.h"</span>
<span style="color: #b218b2;">#include</span> <span style="color: #ff1f8b;">"stm32f4xx_hal.h"</span>

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE BEGIN Includes </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #b218b2;">#include</span> <span style="color: #ff1f8b;">"dwt_stm32_delay.h"</span>
<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE END Includes </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Private variables ---------------------------------------------------------</span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #18b2b2;">TIM_HandleTypeDef</span> <span style="color: #ff8700;">htim4</span>;

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE BEGIN PV </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Private variables ---------------------------------------------------------</span><span style="color: #b2b2b2; font-style: italic;">*/</span>

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Captured Values </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #18b2b2;">uint32_t</span>               <span style="color: #ff8700;">uwIC3Value1</span> = 0;
<span style="color: #18b2b2;">uint32_t</span>               <span style="color: #ff8700;">uwIC3Value2</span> = 0;
<span style="color: #18b2b2;">uint32_t</span>               <span style="color: #ff8700;">uwDiffCapture</span> = 0;

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Capture index </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #18b2b2;">uint16_t</span>               <span style="color: #ff8700;">uhCaptureIndex</span> = 0;

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Frequency Value </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #18b2b2;">uint32_t</span>               <span style="color: #ff8700;">uwFrequency</span> = 0;

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">T value as 125 usec </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #00af00;">static</span> <span style="color: #18b2b2;">unsigned</span> <span style="color: #18b2b2;">long</span> <span style="color: #ff8700;">T</span> = 125*0.000001;
<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Delta_T value as 25 usec </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #00af00;">static</span> <span style="color: #18b2b2;">unsigned</span> <span style="color: #18b2b2;">long</span> <span style="color: #ff8700;">Delta_T</span> = 25*0.000001;
<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Receiving buffer initialization </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #00af00;">static</span> <span style="color: #18b2b2;">unsigned</span> <span style="color: #18b2b2;">char</span> <span style="color: #ff8700;">rx_msg</span>[valid_bits] = {0};
<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">The value sent by the slave (Disc_STM32F3) </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #00af00;">static</span> <span style="color: #18b2b2;">unsigned</span> <span style="color: #18b2b2;">char</span> <span style="color: #ff8700;">response</span> = 0x96;

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE END PV </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Private function prototypes -----------------------------------------------</span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #18b2b2;">void</span> <span style="color: #ef2929;">SystemClock_Config</span>(<span style="color: #18b2b2;">void</span>);
<span style="color: #00af00;">static</span> <span style="color: #18b2b2;">void</span> <span style="color: #ef2929;">MX_GPIO_Init</span>(<span style="color: #18b2b2;">void</span>);
<span style="color: #00af00;">static</span> <span style="color: #18b2b2;">void</span> <span style="color: #ef2929;">MX_TIM4_Init</span>(<span style="color: #18b2b2;">void</span>);

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE BEGIN PFP </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Private function prototypes -----------------------------------------------</span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Manchester_Rx functions </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #00af00;">static</span> <span style="color: #18b2b2;">unsigned</span> <span style="color: #18b2b2;">char</span>  <span style="color: #ef2929;">Manch_Rx</span>(<span style="color: #18b2b2;">unsigned</span> <span style="color: #18b2b2;">char</span>* <span style="color: #ff8700;">rx_msg</span>);
<span style="color: #00af00;">static</span> <span style="color: #18b2b2;">void</span> <span style="color: #ef2929;">Manch_Rx_Error</span>(<span style="color: #18b2b2;">void</span>);
<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE END PFP </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE BEGIN 0 </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE END 0 </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

<span style="color: #18b2b2;">int</span> <span style="color: #ef2929;">main</span>(<span style="color: #18b2b2;">void</span>)
{

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE BEGIN 1 </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE END 1 </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">MCU Configuration----------------------------------------------------------</span><span style="color: #b2b2b2; font-style: italic;">*/</span>

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Reset of all peripherals, Initializes the Flash interface and the Systick. </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  HAL_Init();

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE BEGIN Init </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE END Init </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Configure the system clock </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  SystemClock_Config();

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE BEGIN SysInit </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE END SysInit </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Initialize all configured peripherals </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  MX_GPIO_Init();
  MX_TIM4_Init();

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE BEGIN 2 </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Call the Manchester_Rx function here and compare the "response"</span>
<span style="color: #b2b2b2; font-style: italic;">     and "rx_msg" values </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE END 2 </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Infinite loop </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE BEGIN WHILE </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  <span style="color: #00af00;">while</span> (1)
  {
    Manch_Rx(rx_msg);
    <span style="color: #00af00;">if</span>(*rx_msg == response)
      {
        <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Turn On LED_Green </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
        HAL_GPIO_WritePin(LED_Green_GPIO_Port, LED_Green_Pin, GPIO_PIN_SET);
      }
    <span style="color: #00af00;">else</span>
      {
        <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Turn on LED_Blue </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
        HAL_GPIO_WritePin(LED_Blue_GPIO_Port, LED_Blue_Pin, GPIO_PIN_SET);
      }
  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE END WHILE </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE BEGIN 3 </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

  }
  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE END 3 </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

}

<span style="color: #b2b2b2; font-style: italic;">/** </span><span style="color: #b2b2b2; font-style: italic;">System Clock Configuration</span>
<span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #18b2b2;">void</span> <span style="color: #ef2929;">SystemClock_Config</span>(<span style="color: #18b2b2;">void</span>)
{

  <span style="color: #18b2b2;">RCC_OscInitTypeDef</span> <span style="color: #ff8700;">RCC_OscInitStruct</span>;
  <span style="color: #18b2b2;">RCC_ClkInitTypeDef</span> <span style="color: #ff8700;">RCC_ClkInitStruct</span>;

    <span style="color: #b2b2b2; font-style: italic;">/**</span><span style="color: #b2b2b2; font-style: italic;">Configure the main internal regulator output voltage </span>
<span style="color: #b2b2b2; font-style: italic;">    </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    <span style="color: #b2b2b2; font-style: italic;">/**</span><span style="color: #b2b2b2; font-style: italic;">Initializes the CPU, AHB and APB busses clocks </span>
<span style="color: #b2b2b2; font-style: italic;">    </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 16;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  <span style="color: #00af00;">if</span> (HAL_RCC_OscConfig(&amp;RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    <span style="color: #b2b2b2; font-style: italic;">/**</span><span style="color: #b2b2b2; font-style: italic;">Initializes the CPU, AHB and APB busses clocks </span>
<span style="color: #b2b2b2; font-style: italic;">    </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  <span style="color: #00af00;">if</span> (HAL_RCC_ClockConfig(&amp;RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    <span style="color: #b2b2b2; font-style: italic;">/**</span><span style="color: #b2b2b2; font-style: italic;">Configure the Systick interrupt time </span>
<span style="color: #b2b2b2; font-style: italic;">    </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    <span style="color: #b2b2b2; font-style: italic;">/**</span><span style="color: #b2b2b2; font-style: italic;">Configure the Systick </span>
<span style="color: #b2b2b2; font-style: italic;">    </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">SysTick_IRQn interrupt configuration </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">TIM4 init function </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #00af00;">static</span> <span style="color: #18b2b2;">void</span> <span style="color: #ef2929;">MX_TIM4_Init</span>(<span style="color: #18b2b2;">void</span>)
{

  <span style="color: #18b2b2;">TIM_MasterConfigTypeDef</span> <span style="color: #ff8700;">sMasterConfig</span>;
  <span style="color: #18b2b2;">TIM_IC_InitTypeDef</span> <span style="color: #ff8700;">sConfigIC</span>;

  htim4.Instance = TIM4;
  htim4.Init.Prescaler = 0;
  htim4.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim4.Init.Period = 0xFFFF;
  htim4.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  <span style="color: #00af00;">if</span> (HAL_TIM_IC_Init(&amp;htim4) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  <span style="color: #00af00;">if</span> (HAL_TIMEx_MasterConfigSynchronization(&amp;htim4, &amp;sMasterConfig) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  sConfigIC.ICPolarity = TIM_INPUTCHANNELPOLARITY_BOTHEDGE;
  sConfigIC.ICSelection = TIM_ICSELECTION_DIRECTTI;
  sConfigIC.ICPrescaler = TIM_ICPSC_DIV1;
  sConfigIC.ICFilter = 0;
  <span style="color: #00af00;">if</span> (HAL_TIM_IC_ConfigChannel(&amp;htim4, &amp;sConfigIC, TIM_CHANNEL_3) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

<span style="color: #b2b2b2; font-style: italic;">/** </span><span style="color: #b2b2b2; font-style: italic;">Configure pins as </span>
<span style="color: #b2b2b2; font-style: italic;">        * Analog </span>
<span style="color: #b2b2b2; font-style: italic;">        * Input </span>
<span style="color: #b2b2b2; font-style: italic;">        * Output</span>
<span style="color: #b2b2b2; font-style: italic;">        * EVENT_OUT</span>
<span style="color: #b2b2b2; font-style: italic;">        * EXTI</span>
<span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #00af00;">static</span> <span style="color: #18b2b2;">void</span> <span style="color: #ef2929;">MX_GPIO_Init</span>(<span style="color: #18b2b2;">void</span>)
{

  <span style="color: #18b2b2;">GPIO_InitTypeDef</span> <span style="color: #ff8700;">GPIO_InitStruct</span>;

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">GPIO Ports Clock Enable </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();

  <span style="color: #b2b2b2; font-style: italic;">/*</span><span style="color: #b2b2b2; font-style: italic;">Configure GPIO pin Output Level </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  HAL_GPIO_WritePin(GPIOF, LED_Green_Pin|LED_Blue_Pin|LED_Yellow_Pin|LED_Red_Pin, GPIO_PIN_RESET);

  <span style="color: #b2b2b2; font-style: italic;">/*</span><span style="color: #b2b2b2; font-style: italic;">Configure GPIO pins : LED_Green_Pin LED_Blue_Pin LED_Yellow_Pin LED_Red_Pin </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  GPIO_InitStruct.Pin = LED_Green_Pin|LED_Blue_Pin|LED_Yellow_Pin|LED_Red_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOF, &amp;GPIO_InitStruct);

  <span style="color: #b2b2b2; font-style: italic;">/*</span><span style="color: #b2b2b2; font-style: italic;">Configure GPIO pin : WKUP_BUTTON_Pin </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  GPIO_InitStruct.Pin = WKUP_BUTTON_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(WKUP_BUTTON_GPIO_Port, &amp;GPIO_InitStruct);

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">EXTI interrupt init</span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  HAL_NVIC_SetPriority(EXTI0_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI0_IRQn);

}

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE BEGIN 4 </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Manchester Rx Function </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

<span style="color: #18b2b2;">unsigned</span> <span style="color: #18b2b2;">char</span> <span style="color: #ef2929;">Manch_Rx</span>(<span style="color: #18b2b2;">unsigned</span> <span style="color: #18b2b2;">char</span>* <span style="color: #ff8700;">rx_msg</span>)
{
  <span style="color: #18b2b2;">unsigned</span> <span style="color: #18b2b2;">char</span> <span style="color: #ff8700;">Current_bit</span> = 0;
  <span style="color: #18b2b2;">unsigned</span> <span style="color: #18b2b2;">char</span> <span style="color: #ff8700;">Next_bit</span> = 0;
  <span style="color: #18b2b2;">unsigned</span> <span style="color: #18b2b2;">char</span> <span style="color: #ff8700;">bit_mask</span> = 0x80;
  <span style="color: #18b2b2;">unsigned</span> <span style="color: #18b2b2;">char</span> <span style="color: #ff8700;">rx_bits</span> = 0;
  <span style="color: #00af00;">while</span> (bit_mask)
    {

      <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Wait till both the data is in synchronization </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
      <span style="color: #00af00;">while</span> (<span style="color: #cc0000;">!</span>((uwFrequency &lt; (2*T-Delta_T)) &amp; (uwFrequency &gt; (2*T+Delta_T))))
        {
          HAL_TIM_IC_CaptureCallback(&amp;htim4);
        }
      <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Store this value as Current_bit when the data is in sync </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
      <span style="color: #00af00;">if</span>((HAL_GPIO_ReadPin(TIM_4_3_GPIO_Port, TIM_4_3_Pin)) == GPIO_PIN_SET)
        {
          Current_bit = 1;
        }
      <span style="color: #00af00;">else</span> <span style="color: #00af00;">if</span>((HAL_GPIO_ReadPin(TIM_4_3_GPIO_Port,TIM_4_3_Pin)) == GPIO_PIN_RESET)
        {
          Current_bit = 0;
        }
      HAL_TIM_IC_CaptureCallback(&amp;htim4);
      <span style="color: #00af00;">if</span>((uwFrequency &gt; (T-Delta_T)) &amp; (uwFrequency &lt; (T-Delta_T)))
        {
          HAL_TIM_IC_CaptureCallback(&amp;htim4);
          <span style="color: #00af00;">if</span>((uwFrequency &gt; (T-Delta_T)) &amp; (uwFrequency &lt; (T-Delta_T)))
            {
              Next_bit = Current_bit;
            }
          <span style="color: #00af00;">else</span>
            {
              Manch_Rx_Error();
            }
        }
      <span style="color: #00af00;">else</span> <span style="color: #00af00;">if</span>((uwFrequency &gt; (2*T-Delta_T)) &amp; (uwFrequency &lt; (2*T-Delta_T)))
        {
          Next_bit = ~ Current_bit;
        }
      <span style="color: #00af00;">else</span>
        {
          Manch_Rx_Error();
        }
      rx_msg[rx_bits] = Next_bit;
      rx_bits++;
      bit_mask = bit_mask &gt;&gt; 1;
    }

  <span style="color: #00af00;">return</span> *rx_msg;
}

<span style="color: #18b2b2;">void</span> <span style="color: #ef2929;">Manch_Rx_Error</span>(<span style="color: #18b2b2;">void</span>)
{
  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Blink Red LED </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  HAL_GPIO_WritePin(LED_Red_GPIO_Port, LED_Red_Pin, GPIO_PIN_SET);
}

<span style="color: #cc0000;">/**</span>
<span style="color: #cc0000;">  * </span><span style="color: #1f5bff;">@brief</span><span style="color: #cc0000;">  Conversion complete callback in non blocking mode </span>
<span style="color: #cc0000;">  * </span><span style="color: #1f5bff;">@param</span><span style="color: #cc0000;">  htim: TIM handle</span>
<span style="color: #cc0000;">  * </span><span style="color: #1f5bff;">@retval</span><span style="color: #cc0000;"> None</span>
<span style="color: #cc0000;">  */</span>
<span style="color: #18b2b2;">void</span> <span style="color: #ef2929;">HAL_TIM_IC_CaptureCallback</span>(<span style="color: #18b2b2;">TIM_HandleTypeDef</span> *<span style="color: #ff8700;">htim</span>)
{
  <span style="color: #00af00;">if</span> (htim-&gt;Channel == HAL_TIM_ACTIVE_CHANNEL_3)
  {
    <span style="color: #00af00;">if</span>(uhCaptureIndex == 0)
    {
      <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Get the 1st Input Capture value </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
      uwIC3Value1 = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_3);
      uhCaptureIndex = 1;
    }
    <span style="color: #00af00;">else</span> <span style="color: #00af00;">if</span>(uhCaptureIndex == 1)
    {
      <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Get the 2nd Input Capture value </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
      uwIC3Value2 = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_3); 

      <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Capture computation </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
      <span style="color: #00af00;">if</span> (uwIC3Value2 &gt; uwIC3Value1)
      {
        uwDiffCapture = (uwIC3Value2 - uwIC3Value1); 
      }
      <span style="color: #00af00;">else</span>  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">(uwIC2Value2 &lt;= uwIC2Value1) </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
      {
        uwDiffCapture = ((0xFFFF - uwIC3Value1) + uwIC3Value2); 
      }

      <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Frequency computation: for this example TIMx (TIM1) is clocked by</span>
<span style="color: #b2b2b2; font-style: italic;">         2xAPB2Clk </span><span style="color: #b2b2b2; font-style: italic;">*/</span>      
      uwFrequency = (2*HAL_RCC_GetPCLK1Freq()) / uwDiffCapture;
      uhCaptureIndex = 0;

    }
  }
}

<span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE END 4 </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

<span style="color: #cc0000;">/**</span>
<span style="color: #cc0000;">  * </span><span style="color: #1f5bff;">@brief</span><span style="color: #cc0000;">  This function is executed in case of error occurrence.</span>
<span style="color: #cc0000;">  * </span><span style="color: #1f5bff;">@param</span><span style="color: #cc0000;">  None</span>
<span style="color: #cc0000;">  * </span><span style="color: #1f5bff;">@retval</span><span style="color: #cc0000;"> None</span>
<span style="color: #cc0000;">  */</span>
<span style="color: #18b2b2;">void</span> <span style="color: #ef2929;">_Error_Handler</span>(<span style="color: #18b2b2;">char</span> * <span style="color: #ff8700;">file</span>, <span style="color: #18b2b2;">int</span> <span style="color: #ff8700;">line</span>)
{
  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE BEGIN Error_Handler_Debug </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">Turn on LED Yellow </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  HAL_GPIO_WritePin(LED_Yellow_GPIO_Port, LED_Yellow_Pin, GPIO_PIN_SET);
  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">User can add his own implementation to report the HAL error return state </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  <span style="color: #00af00;">while</span>(1) 
  {
  }
  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE END Error_Handler_Debug </span><span style="color: #b2b2b2; font-style: italic;">*/</span> 
}

<span style="color: #b218b2;">#ifdef</span> USE_FULL_ASSERT

<span style="color: #cc0000;">/**</span>
<span style="color: #cc0000;">   * </span><span style="color: #1f5bff;">@brief</span><span style="color: #cc0000;"> Reports the name of the source file and the source line number</span>
<span style="color: #cc0000;">   * where the assert_param error has occurred.</span>
<span style="color: #cc0000;">   * </span><span style="color: #1f5bff;">@param</span><span style="color: #cc0000;"> file: pointer to the source file name</span>
<span style="color: #cc0000;">   * </span><span style="color: #1f5bff;">@param</span><span style="color: #cc0000;"> line: assert_param error line source number</span>
<span style="color: #cc0000;">   * </span><span style="color: #1f5bff;">@retval</span><span style="color: #cc0000;"> None</span>
<span style="color: #cc0000;">   */</span>
<span style="color: #18b2b2;">void</span> <span style="color: #ef2929;">assert_failed</span>(<span style="color: #18b2b2;">uint8_t</span>* <span style="color: #ff8700;">file</span>, <span style="color: #18b2b2;">uint32_t</span> <span style="color: #ff8700;">line</span>)
{
  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE BEGIN 6 </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">User can add his own implementation to report the file name and line number,</span>
<span style="color: #b2b2b2; font-style: italic;">    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) </span><span style="color: #b2b2b2; font-style: italic;">*/</span>
  <span style="color: #b2b2b2; font-style: italic;">/* </span><span style="color: #b2b2b2; font-style: italic;">USER CODE END 6 </span><span style="color: #b2b2b2; font-style: italic;">*/</span>

}

<span style="color: #b218b2;">#endif</span>

<span style="color: #cc0000;">/**</span>
<span style="color: #cc0000;">  * @}</span>
<span style="color: #cc0000;">  */</span> 

<span style="color: #cc0000;">/**</span>
<span style="color: #cc0000;">  * @}</span>
<span style="color: #cc0000;">*/</span> 

<span style="color: #b2b2b2; font-style: italic;">/************************ </span><span style="color: #b2b2b2; font-style: italic;">(C) COPYRIGHT STMicroelectronics *****END OF FILE***</span><span style="color: #b2b2b2; font-style: italic;">*/</span>


</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Foo X. Bar</p>
<p class="date">Created: 2017-11-23 Do 16:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
